
//****************************************************************************************************
//
// Определение длины месяца в днях с учетом високостных лет.
//
// Год является високосным, если год делится на 4 без остатка.
// Год не является високосным, если он полностью делится и на 4, и на 100.
// Год является високосным, если он делится и на 4, и на 100, и на 400.
//
//****************************************************************************************************
// January == 0
// mL = monthLong( 1996, 0 );
//****************************************************************************************************

function monthLong( y, m ) {

    if ( m == 1 ) { return y%4 || ( !(y%100) && y%400 ) ? 28 : 29; }
    else { return m===3 || m===5 || m===8 || m===10 ? 30 : 31; }

}

//****************************************************************************************************
