
//****************************************************************************************************
// Преобразование даты-объекта в строку YYYY-MM-DD
//****************************************************************************************************
//
// "1970-01-01"
// strDate = dateToString( new Date );
//
// Object Date without Time
// objDate = new Date( dateToString( new Date ) );
//
//****************************************************************************************************

function dateToString( dt ) {

    if ( dt === null ) { return "1970-01-01"; }
    if ( typeof dt === "undefined" ) { return "1970-01-01"; }

    var y = dt.getFullYear();
    var m = dt.getMonth() + 1;
    var d = dt.getDate();

    if ( m < 10 ) { m = "0" + m; }
    if ( d < 10 ) { d = "0" + d; }

    return  y + "-" + m + "-" + d;

}

//****************************************************************************************************
