<?php
//**************************************************************************************************
// txtToSQL
//**************************************************************************************************
//
//    include 'php/function_txtToSQL.php';
//
//    $txtVar = "  d'Artanjan ";
//
//    $txtSQL .= txtToSQL( $txtVar );
//
//    $txtSQL .= txtToSQL( $txtVar, 50 );
//
//**************************************************************************************************

function txtToSQL( $txtVar, $txtLen = 0 ) {

     // Экранируются одиночная кавычка ('), двойная кавычка ("), обратный слэш (\) и NUL (байт NULL)
     $txtVar = addslashes( $txtVar );

     $txtVar = trim( $txtVar );

     // 0 - не ограничивать длину строки
     if ( $txtLen > 0 ) {
         $txtVar = substr( $txtVar, 0, $txtLen );
     }

     return $txtVar;

}

//**************************************************************************************************
?>