<?php
//**************************************************************************************************
// SQLtoJSON
//**************************************************************************************************
//
//    include 'php/function_SQLtoArray.php';
//
//    $txtSQL = "SELECT * FROM myTable";
//
//    SQLtoJSON( $txtSQL );
//
//**************************************************************************************************

function SQLtoJSON( $txtSQL ) {

    $qqqSQL = SQLexec( $txtSQL );
    $cntSQL = $qqqSQL->num_rows;

    // Перенос записей запроса в массив
    $json = array();
    for ( $i=0; $i<$cntSQL; $i++ ) {
        $json[$i] = $qqqSQL->fetch_assoc();
    }

    // Конвертирование массива в JSON
    echo json_encode( $json );

}

//**************************************************************************************************
?>