<?php
//**************************************************************************************************
// Проверка существования сессии
//**************************************************************************************************

session_start();

if ( !isset( $_SESSION['User_ID'] ) or $_SESSION['User_ID'] == 0 ) {
    $json["Status"] = 'Session not exists.';
    $json["User_Login"] = '';
}
else {
    $json["Status"] = 'Session exists.';
    $json["User_Login"] = $_SESSION['User_Login'];
}

echo json_encode( $json );

//**************************************************************************************************
?>